  { "name": "Chosen One", "description": "A protagonist destined for greatness, often tied to prophecy or legacy." },
  { "name": "Wise Mentor", "description": "An experienced guide who provides wisdom and training to the hero." },
  { "name": "Loyal Companion", "description": "A steadfast ally who supports the protagonist through every challenge." },
  { "name": "Hidden Mage", "description": "A character concealing magical powers in plain sight or modern society." },
  { "name": "Skeptic Detective", "description": "A rational investigator who struggles to accept supernatural truths." },
  { "name": "Fae Trickster", "description": "A mischievous, otherworldly being who plays with perception and morality." },
  { "name": "Anti-Hero", "description": "A morally ambiguous lead who seeks redemption or power through flawed means." },
  { "name": "Cursed Warrior", "description": "A battle-hardened fighter burdened by a magical or emotional curse." },
  { "name": "Sinister Advisor", "description": "A manipulative figure guiding others for personal or dark motives." },
  { "name": "Demi-God", "description": "A powerful being caught between mortal and divine worlds." },
  { "name": "Sacred Guardian", "description": "A protector of mystical knowledge or realms, often bound by duty." },
  { "name": "Mortal Prophet", "description": "An ordinary person given visions that shape events or reveal truths." },
  { "name": "Reimagined Princess", "description": "A classic fairytale figure reinvented with agency and complexity." },
  { "name": "Wicked Stepmother", "description": "A controlling or jealous antagonist rooted in folklore archetypes." },
  { "name": "Ordinary Youth", "description": "A relatable protagonist thrust into an extraordinary world." },
  { "name": "Sentient Realm", "description": "A living world or location with personality and influence on the story." },
  { "name": "Gatekeeper", "description": "A character who controls passage between realms or secret places." },
  { "name": "Brash Hero", "description": "An impulsive adventurer who dives headfirst into danger." },
  { "name": "Tower Wizard", "description": "An enigmatic sorcerer who holds deep arcane knowledge." },
  { "name": "Seductive Rogue", "description": "A charismatic trickster with questionable loyalties." },
  { "name": "Rational Scientist", "description": "A logic-driven thinker motivated by knowledge and discovery." },
  { "name": "AI Companion", "description": "An artificial being with intelligence and evolving emotions." },
  { "name": "Hacker Rebel", "description": "A digital insurgent fighting oppressive systems with code." },
  { "name": "Streetwise Mercenary", "description": "A gritty freelancer navigating high-tech chaos." },
  { "name": "Starship Captain", "description": "A leader balancing diplomacy, warfare, and crew dynamics." },
  { "name": "Galactic Tyrant", "description": "A powerful antagonist seeking control over the cosmos." },
  { "name": "Time Wanderer", "description": "A temporal drifter navigating eras and personal loss." },
  { "name": "Timeline Enforcer", "description": "A guardian ensuring history stays intact against anomalies." },
  { "name": "Enhanced Human", "description": "A genetically or technologically altered character grappling with identity." },
  { "name": "Rogue AI", "description": "An autonomous entity breaking free of human control." },
  { "name": "Resistance Leader", "description": "A rebel pushing back against totalitarian power structures." },
  { "name": "Monitored Citizen", "description": "An ordinary person whose life is under constant surveillance." },
  { "name": "Gunslinger", "description": "A skilled marksman guided by personal code in a lawless world." },
  { "name": "Outlaw", "description": "A fugitive living outside societal rules, often with charm or menace." },
  { "name": "Town Sheriff", "description": "A figure of law and order trying to maintain peace under pressure." },
  { "name": "Flawed Hero", "description": "A protagonist haunted by past mistakes yet striving to do right." },
  { "name": "Disillusioned War Vet", "description": "A hardened survivor struggling with trauma and purpose." },
  { "name": "Rancher", "description": "A grounded, independent character tied to the land and legacy." },
  { "name": "Urban Cop", "description": "A law enforcer navigating the moral complexities of modern crime." },
  { "name": "Lone Avenger", "description": "A solitary figure driven by revenge or justice." },
  { "name": "Mech Wrangler", "description": "A pilot or engineer commanding futuristic machines." },
  { "name": "Space Sheriff", "description": "A hybrid of frontier justice and intergalactic law enforcement." },
  { "name": "Quirky Sleuth", "description": "An eccentric amateur detective solving mysteries with charm." },
  { "name": "Nosy Neighbor", "description": "A busybody who inadvertently uncovers critical clues." },
  { "name": "Cynical PI", "description": "A hardened private eye with a bleak worldview and keen instincts." },
  { "name": "Femme Fatale", "description": "A seductive, manipulative figure hiding dangerous secrets." },
  { "name": "Forensics Expert", "description": "A detail-oriented analyst who deciphers evidence for truth." },
  { "name": "Rookie Cop", "description": "A fresh recruit learning the ropes under fire." },
  { "name": "Isolated Guests", "description": "Characters trapped together where secrets fuel tension." },
  { "name": "Silent Witness", "description": "An observer holding crucial information yet unable to speak." },
  { "name": "Unstable Protagonist", "description": "A central character whose grip on reality unravels." },
  { "name": "Manipulative Partner", "description": "A close companion who exploits trust for personal gain." },
  { "name": "Fugitive", "description": "A wrongfully accused or guilty character on the run." },
  { "name": "Framed Innocent", "description": "An individual caught in a crime they didn’t commit." },
  { "name": "Whistleblower", "description": "A truth-teller risking everything to expose corruption." },
  { "name": "Corrupt Official", "description": "A figure abusing power for personal or political gain." },
  { "name": "Hacker Hero", "description": "A skilled coder using tech to fight oppression." },
  { "name": "System Architect", "description": "A creator or controller of digital frameworks with power to alter outcomes." }
  { "name": "Final Girl", "description": "A lone survivor who outlasts horror through resilience and intuition." },
  { "name": "Paranormal Expert", "description": "A knowledgeable investigator of supernatural phenomena." },
  { "name": "Doomed Caretaker", "description": "A well-meaning character drawn into dark forces beyond their control." },
  { "name": "Sinister Child", "description": "An unnerving young character harboring mysterious or malevolent power." },
  { "name": "Eldritch Entity", "description": "A cosmic, unknowable being that defies logic and instills existential fear." },
  { "name": "Skeptic Turned Believer", "description": "A rational character forced to accept terrifying truths." },
  { "name": "Brooding Love Interest", "description": "A mysterious romantic figure with emotional depth and guarded vulnerability." },
  { "name": "Optimist", "description": "A hopeful character who believes in love despite adversity." },
  { "name": "Matchmaker", "description": "A meddling friend or relative who orchestrates romantic entanglements." },
  { "name": "Rebound", "description": "A romantic partner chosen to distract or recover from heartbreak." },
  { "name": "Forbidden Flame", "description": "A love interest who defies social rules or family expectations." },
  { "name": "Lovable Fool", "description": "A comical character whose mistakes endear them to others." },
  { "name": "Overconfident Underdog", "description": "A flawed yet determined character whose bravado masks insecurity." },
  { "name": "Naïve Genius", "description": "A character with remarkable intellect but poor social awareness." },
  { "name": "Deadpan Observer", "description": "A dry-witted character who calmly reacts to absurdity." },
  { "name": "Social Climber", "description": "A character obsessed with status who often fumbles their ascent." },
  { "name": "Disappointed Parent", "description": "A stern caregiver struggling with unmet expectations." },
  { "name": "Idealistic Youth", "description": "A passionate young character driven to change the world." },
  { "name": "Disillusioned Professional", "description": "An expert grappling with the corruption or failures of their field." },
  { "name": "Quiet Sufferer", "description": "A character enduring hardship in silence and dignity." },
  { "name": "Spiraling Genius", "description": "A brilliant mind unraveling under emotional or ethical strain." },
  { "name": "Reluctant Explorer", "description": "A hesitant traveler drawn into a journey that changes them." },
  { "name": "Seasoned Guide", "description": "An experienced adventurer helping others navigate danger." },
  { "name": "Burdened Scholar", "description": "A knowledgeable character haunted by secrets or responsibilities." },
  { "name": "Rival Adventurer", "description": "A competing explorer who challenges the protagonist’s journey." },
  { "name": "Curious Child", "description": "A young character whose wonder and questions unveil truths." },
  { "name": "Enlightened Revolutionary", "description": "A visionary challenging oppressive systems through radical change." },
  { "name": "Noble Peasant", "description": "A humble character who embodies integrity and resilience." },
  { "name": "War-weary Soldier", "description": "A fighter carrying the emotional toll of violence." },
  { "name": "Scheming Aristocrat", "description": "A cunning noble manipulating events for power or prestige." },
  { "name": "Doomed Monarch", "description": "A ruler whose downfall is inevitable, often due to hubris or betrayal." },
  { "name": "Mastermind", "description": "A brilliant strategist orchestrating complex plans, often for crime." },
  { "name": "Cop with a Past", "description": "A law enforcer haunted by personal history or missteps." },
  { "name": "Undercover Mole", "description": "A character hiding their true identity to infiltrate enemies." },
  { "name": "Manipulated Victim", "description": "An unsuspecting character drawn into schemes beyond their control." },
  { "name": "Law-Abiding Citizen Turned Rogue", "description": "An everyday person pushed to break moral or legal boundaries." },
  { "name": "Stoic Warrior", "description": "A disciplined fighter guided by principle and restraint." },
  { "name": "Sidekick with Heart", "description": "A loyal companion providing emotional depth and comic relief." },
  { "name": "Genius Strategist", "description": "A tactician whose brilliance influences battles or plans." },
  { "name": "Reluctant Hero", "description": "A hesitant protagonist who rises to the occasion against their will." },
  { "name": "Fallen Leader", "description": "A once-respected figure coping with disgrace or failure." },
  { "name": "Truth-Seeker", "description": "A character driven to uncover facts in pursuit of justice or understanding." },
  { "name": "Subject Matter Expert", "description": "A knowledgeable narrator offering insight and clarity." },
  { "name": "Reluctant Witness", "description": "Someone pulled into a story by proximity to tragedy or injustice." },
  { "name": "Cultural Narrator", "description": "A guide who contextualizes traditions or lived experiences." },
  { "name": "Aspiring Performer", "description": "A character dreaming of recognition on the stage or screen." },
  { "name": "Mentor Musician", "description": "An experienced artist helping younger talents refine their craft." },
  { "name": "Rival Singer", "description": "A competitive performer who clashes or grows alongside the protagonist." },
  { "name": "Haunted Artist", "description": "A creative individual grappling with inner demons and public expectation." },
  { "name": "Hopeful Youth", "description": "A young performer chasing joy, acceptance, and personal voice." }
